using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Lesson10.ExtensionMethods
{
    public static class ListExtensions     // Φτιάχνω μία static κλάση που θα περιέχει static μεθόδους που θα αναβαθμίζουν ή θα επεκτείνουν υπάρχοντες τύπους και η κλάση αυτή βρίσκεται σε διαφορετικό πακέτο.
    {
        public static void InsertToFront<T>(this List<T> list, T item)    // Αυτή η μέθοδος είναι παραμετροποιημένη, που σημαίνει ότι δουλεύει με κάθε τύπο Τ. Δημιουργία extension μεθόδου, η οποία είναι void (δεν θα επιστρέφει κάτι), ανήκει στην κλάση και είναι (static) και ως πρώτο argument μπαίνει πάντα το αντικείμενο πάνω στο οποίο καλείται, όπου αυτό το argument ενεργεί πάνω στην λίστα ListOfIntegers και χρησιμοποιούμαι το this, για να πούμε ότι αυτή είναι η λίστα πάνω στην οποία θα ενεργήσει αυτή η μέθοδος. Ως δεύτερο argument μπαίνει κι ένα δεδομένο τύπου T, δηλαδή το item που θα μπει και μπορεί να είναι είτε τύπου string είτε τύπου int. Πιο συγκεκριμένα, όταν παραμετροποιούμε μεθόδους χρειάζεται να πούμε τί είναι αυτό το T, το οποίο όταν μπαίνει δίπλα από το όνομα της μεθόδου, τότε λειτουργεί ως είσοδος, που σημαίνει ότι με ότι T(τύπο) παραμετροποιήσω την μέθοδο, τότε θα είναι ο ίδιος ακριβώς τύπος και για τις 2 παραμέτρους της μεθόδου. Δηλαδή εάν παραμετροποιήσω την μέθοδο με το T να είναι τύπου int, τότε και τα 2 arguments που λαμβάνει η μέθοδος θα είναι ίδιου τύπου, δηλαδή int. 
        {
            list.Insert(0, item);     // Πάνω στην λίστα που θα εκτελεστεί η μέθοδος Insert, στο (index = 0), θέλουμε να βάλουμε αυτό το item, που δέχεται από την παράμετρο εισόδου η μέθοδος InsertToFront. 
        }

        public static List<TTarget> ConvertTo<TSource, TTarget>(this List<TSource> arithList)      // Στην ουσία η μέθοδος ConvertTo ξεκλειδώνεται ως extension method για κάθε λίστα που δέχεται οποιονδήποτε παραμετροποιημένο τύπο. Δημιουργία μίας μεθόδου, η οποία θα μετατρέπει μία λίστα από έναν οποιοδήποτε τύπο και θα επιστρέφει μία λίστα με το (ΤTarget => πρόκειται για την λίστα μετά την μετατροπή που θα επιστρέφεται).
        {
            var returnedList = new List<TTarget>();       // Δημιουργία λίστας που θα είναι κενή με ότι τύπο είναι το TTarget.
            foreach(var item in arithList)    // Μέσω της foreach διατρέχω ένα-ένα τα στοιχεία σε κάθε επανάληψη.
            {
                TTarget itemAfterCast = (TTarget)Convert.ChangeType(item, typeof(TTarget));
                returnedList.Add(itemAfterCast);     // Σε αυτό το σημείο μέσα στην λίστα (returnedList), πραγματοποιείται η προσθήκη ενός item (μέσω της μεθόδου Add), με ρητή μετατροπή σε τύπο δεδομένου TTarget(δηλαδή ότι τύπος είναι το TTarget-είτε integer-είτε string), μέσω του explicit conversion, με ευθύνη που παίρνει ο ίδιος ο προγραμματιστής για αυτή την ρητή μετατροπή. Πρόκειται για έναν οποιοδήποτε τύπο και για αυτό το κάνω Generic, δηλαδή TTarget. Στην ουσία εδώ χρησιμοποιείται η μέθοδος ChangeType της κλάσης Convert, για να γίνει η μετατροπή. 
            }
            return returnedList;     // Η λίστα αυτή (returnedList), θα επιστρέφεται μέσω της εντολής return.               
        }
    }
}