using System;
using Lesson10.ExtensionMethods;    // Κάνω import αυτό το namespace Lesson10.ExtensionMethods, το οποίο περιέχει την κλάση ListExtensions.

namespace MyApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            CustomSuperList<string> customList = new CustomSuperList<string>();    // Δημιουργία αυτής της παραμετροποιημένης λίστας τύπου string.
            CustomSuperList<int> customList2 = new CustomSuperList<int>();   // Δημιουργία μίας λίστας, η οποία είναι παραμετροποιημένη τύπου int.
            customList2.Add(4);
            customList.Add("Steven");
            customList.Add("Jason");
            customList.Add("Nina");
            customList.Add("Maria");
            customList.Add("David");
            customList.Add("Jacob");

            customList.RemoveAt(4);   // Για το αντικείμενο, που είναι η λίστα σβήνω το στοιχείο εκείνο που βρίσκεται στην 4η θέση, μέσω της μεθόδου RemoveAt.

            // Παρακάτω δημιουργείται μία λίστα, η οποία θα περιέχει κάποιους ακέραιους αριθμούς. Επομένως η λίστα που δημιουργείται είναι τύπου int.
            var ListOfIntegers = new List<int>{12, 23, 45, 67, 89};
            Console.WriteLine(ListOfIntegers.GetType());   // Σε αυτό το σημείο εάν θέλουμε να έχουμε το Type αντικείμενο από κάποιο instance μιας κλάσης, τότε δεν μπορούμε να χρησιμοποιήσουμε το typeof αλλά την μέθοδο GetType() πάνω στο instance (οποιοδήποτε instance).
            ListOfIntegers.Add(456);    // Μέσω της μεθόδου Add, κάνω προσθήκη ενός αριθμού μέσα στην λίστα και πρόκειται για ακέραιο αριθμό και όχι για string, διότι η λίστα είναι τύπου int.
            ListOfIntegers.InsertToFront<int>(10);    // Σε αυτό το σημείο, παραμετροποιώ την μέθοδο InsertToFront και την δηλώνω ότι θα είναι τύπου integer.

            var listOfStrings = new List<string> {"hello", "world"};
            listOfStrings.InsertToFront<string>("boo");   // Εδώ δηλώνω ότι η μέθοδος InsertToFront περιμένει ένα string τύπου δεδομένο.

            var listofDecimals = new List<decimal>{12m, 12.34m, 45.1m};   // Δημιουργώ μία λίστα από decimals.
            List<int> listOfIntegers2 = listofDecimals.ConvertTo<decimal, int>();     // Στην ουσία εδώ όταν καλέσαμε την πρώτη Extension method InsertToFront εξηγήσαμε πως δεν χρειαζόταν να βάλουμε explicitly το <int> καθώς ο compiler το έκανε infer. Σε αυτή την περίπτωση μπορεί να κάνει infer το TSource ότι είναι decimal, αλλά δεν μπορεί να κάνει infer το TTarget ότι είναι int(ακόμα και αν δηλώναμε explicitly την μεταβλητή integerNumbers). Από τη στιγμή που πρέπει να δηλώσουμε explicitly κάποιον τύπο παραμέτρου, πρέπει να τις δηλώσουμε όλες. Θέλουμε να καλούμε στην listofDecimals την μέθοδο ConvertTo, η οποία δεν θα παίρνει κάποιο argument και θα μας επιστρέφει μία λίστα από integers. Όμως με την μετατροπή αυτή θα χάνεται ακρίβεια, από την στιγμή που θα μετατρέπεται σε int και θα παραλείπεται το δεκαδικό μέρος.

            Console.ReadLine();
        }

        public class CustomSuperList<Τ>      // Παραμετροποιώ την κλάση αυτή, προκειμένου να δουλεύει με όλα και με integers και με strings και με οτιδήποτε.
        {
          private Τ[] _items = new Τ[4];   // Δημιουργία ενός private πίνακα τύπου T, καθώς πρόκειται για ένα μονοδιάστατο πίνακα και βάζοντας το T, στην ουσία του λέω ότι μπορεί να παραμετροποιηθεί με τα πάντα με τον οποιοδήποτε τύπο.
          private int _size = 0;   // Το πεδίο αυτό αρχικοποιείται με την τιμή 0, και σε κάθε στιγμή θα δείχνει στο επόμενο προς εισαγωγή στοιχείο στον πίνακα.

          // Δημιουργία μεθόδου Add για εισαγωγή στοιχείων στον πίνακα καθώς δεν θέλουμε η μέθοδος να επιστρέφει κάτι και θα παίρνει ως όρισμα ένα δεδομένο τύπου T, το οποίο δείχνει ότι πρόκειται για παραμετροποιήσιμο τύπο.
          public void Add(Τ item)
          {
           // _items[_size] = item;   // Μέσα στον πίνακα _items στο στοιχείο εκείνο που βρίσκεται στην θέση που δείχνει το _size εκχωρώ το αλφαριθμητικό (item) που δέχεται από την είσοδο η συγκεκριμένη μέθοδος.
            if(_size >= _items.Length)  // Εδώ κάνω έναν έλεγχο εάν το _size είναι >= του μήκους του πλήθους των θέσεων του πίνακα _items και στην περίπτωση που πάρω true από την συνθήκη, τότε δημιουργεί έναν χώρο διπλάσιο από τον προηγούμενο. 
            {
              var newItemsArray = new Τ[_items.Length*2];    // Σε αυτό το σημείο δημιουργώ έναν νέο πίνακα τύπου T (το οποίο σημαίνει ότι μπορεί να παραμετροποιηθεί με τον οποιοδήποτε τύπο), με διπλάσιο χώρο από ότι είχε ο προηγούμενος πίνακας, δηλαδή πολλαπλασιάζω το μήκος του προηγούμενο πίνακα (_items.Length * 2), για να πιάσει τον διπλάσιο χώρο.
              for(int i = 0; i < _items.Length; i++)  // Με μία επαναληπτική δομή for, διατρέχω το κάθε στοιχέιο του πίνακα _items μέχρι όσο είναι το μήκος του συγκεκριμένου πίνακα.
              {
                newItemsArray[i] = _items[i];   // Το αντίστοιχο στοιχείο[i] του παλιού πίνακα μπαίνει μέσα στον καινούργιο πίνακα ως νέο στοιχείο[i]. Στην ουσία εσωτερικά πηγαίνει στην θέση μνήμης που έχει δεσμεύσει και λειτουργεί ως pointer ως αναφορά.
              }
              _items = newItemsArray;   // Ο παλιός πίνακας πλέον δείχνει στον καινούργιο πίνακα, δηλαδή το πεδίο _items θα δείχνει τώρα στον καινούργιο πίνακα (newItemsArray).
            }
            _items[_size] = item;   // Ο παλιός πίνακας(_items), δείχνει πλέον στον καινούργιο πίνακα item.
            _size++;   // Αύξηση του _size (μεγέθους πίνακα) κατά 1.
          }

           public void RemoveAt(int index)    // Δημιουργία μεθόδου, η οποία αφαιρεί ένα στοιχείο (index) από τον πίνακα και δέχεται σαν παράμετρο εισόδου έναν αριθμό, ο οποίος συμβολίζει τον αριθμό της θέσης του πίνακα.
          {
            if(index < 0 || index >= _size)  // Σε αυτό το σημείο ο χρήστης μπορεί να δώσει ότι index θέλει υπό την προυπόθεση ότι θα πρέπει να είναι μικρότερο του 0 και να μην είναι εκτός των ορίων. Και το index θα πρέπει να φτάσει όσο είναι το _size του πίνακα.
            {
            throw new IndexOutOfRangeException("The index is wrong!");    // Στην περίπτωση που η συνθήκη μού δώσει αποτέλεσμα true, και ο χρήστης έχει εισάγει αρνητικό αριθμό (index) ή έχει εισάγει κάποιο στοιχείο εκτός των ορίων του πίνακα τότε θα του πεταχτεί ένα Exception και συγκεκριμένα ένα IndexOutOfRangeException, που σημαίνει ότι ο χρήστης έχει ξεφύγει από τα όρια του πίνακα. 
            }
            --_size;   // Στην περίπτωση που ο χρήστης μού έχει δώσει σωστά τα στοιχεία για έναν πίνακα, και δεν έχει ξεφύγει από τα όρια του πίνακα, δηλαδή δεν έχει δοθεί αρνητικός αριθμός και ούτε εκτός ορίων πίνακα, τότε μειώνεται το _size κατά 1 μονάδα. 
            for(int i = index; i <= _size; i++)   // Σε μία επαναληπτική δομή for, όπου το i αρχικοποιείται από το index που μόλις έδωσε ο χρήστης και το i θα φτάσει μικρότερο ή ίσο από το _size που μόλις μειώσαμε και με βήμα 1 σε κάθε επανάληψη. 
          {
            _items[i] = _items[i+1];    // Σε κάθε επανάληψη το i θα πρέπει να δείχνει στο διπλανό στοιχείο.
          }
          _items[_size] = default;   // Σε αυτό το σημείο πραγματοποιείται δέσμευση χώρου στον πίνακα, που σημαίνει ότι οι θέσεις δεν είναι κενές, δηλαδή μέσω χρήσης του default, αναλόγως του τί θα είναι ο τύπος κάθε φορά, δηλαδή αν ο παραμετροποιήσιμος τύπος (T) είναι string ή integer, τότε το default παίρνει την ανάλογη τιμή, δηλαδή 0 για integers και null για strings.
          }
        }
    }
}
